In [1]:
import pandas as pd

In [4]:
lib_2014 = pd.read_csv("librarycheckouts_2014.csv")

In [5]:
lib_2014.head(5)

,Unnamed: 0,BibNumber,ItemBarcode,ItemType,Collection,CallNumber,CheckoutDateTime
0,0,1761418,10035956399,acbk,cafic,FIC FITZGER1995,01/19/2014 01:57:00 PM
1,1,2963338,10082228254,acdvd,cadvd,DVD FRUITVA,07/28/2014 07:31:00 PM
2,2,2747444,10073651704,acbk,nyfic,YA BERNE,12/01/2014 10:41:00 AM
3,3,3037991,10083975440,accd,nacd,CD 782.42166 J1807D,11/18/2014 05:59:00 PM
4,4,2747679,10073504804,acbk,canf,791.4302 J949i 2011,01/15/2014 11:35:00 AM

In [6]:
lib_2014.dtypes

Unnamed: 0           int64
BibNumber            int64
ItemBarcode          int64
ItemType            object
Collection          object
CallNumber          object
CheckoutDateTime    object
dtype: object

In [7]:
lib_2014['CheckoutDateTime'] = pd.to_datetime(lib_2014['CheckoutDateTime']) # convert CheckoutDateTime to date/time

In [8]:
lib_2014.dtypes

Unnamed: 0                   int64
BibNumber                    int64
ItemBarcode                  int64
ItemType                    object
Collection                  object
CallNumber                  object
CheckoutDateTime    datetime64[ns]
dtype: object

In [9]:
lib_2014.to_csv('lib_2014_date_time.csv')

In [11]:
lib_2014.tail(5)

,Unnamed: 0,BibNumber,ItemBarcode,ItemType,Collection,CallNumber,CheckoutDateTime
741683,741683,2946707,10081715616,acbk,nanew,641.252 Sp61K 2013,2014-06-20 13:43:00
741684,741684,2746747,10082090894,accd,cabocd,CD FIC ELIOT,2014-08-19 10:53:00
741685,741685,2970688,10081189689,accd,nacd,CD 782.42165 R5432C2,2014-07-28 14:16:00
741686,741686,2509763,10061848346,jcbk,ccpic,E BRUNHOF,2014-10-22 12:55:00
741687,741687,2802142,10076334779,jcbk,ncpic,E SMALLMA,2014-06-12 17:27:00

In [13]:
unique_count = lib_2014['CheckoutDateTime'].nunique()

In [14]:
unique_count

174020

In [15]:
value_counts = lib_2014['CheckoutDateTime'].value_counts()

In [16]:
value_counts

2014-02-22 16:07:00    27
2014-06-29 16:47:00    26
2014-02-20 16:31:00    23
2014-07-20 16:46:00    23
2014-03-09 16:48:00    23
                       ..
2014-12-06 18:01:00     1
2014-07-14 11:35:00     1
2014-11-04 12:51:00     1
2014-10-09 15:01:00     1
2014-08-19 10:53:00     1
Name: CheckoutDateTime, Length: 174020, dtype: int64

In [19]:
count_by_category = lib_2014.groupby('CheckoutDateTime').size().reset_index(name='Count') # counts the number of times a 
# particular entry appears in a column.  I now need to limit the data to the day, not including the time

In [20]:
count_by_category

          CheckoutDateTime  Count
0      2014-01-02 08:30:00      6
1      2014-01-02 08:31:00      5
2      2014-01-02 09:17:00      1
3      2014-01-02 09:32:00      1
4      2014-01-02 09:33:00      4
...                    ...    ...
174015 2014-12-31 17:56:00      7
174016 2014-12-31 17:57:00      1
174017 2014-12-31 17:58:00      2
174018 2014-12-31 17:59:00      1
174019 2014-12-31 18:01:00      1

[174020 rows x 2 columns]

In [22]:
count_by_category['DateOnly'] = count_by_category['CheckoutDateTime'].dt.date # converts date time to a new date only column.
# Now need to amalgamate them

In [23]:
count_by_category.head(5)

     CheckoutDateTime  Count    DateOnly
0 2014-01-02 08:30:00      6  2014-01-02
1 2014-01-02 08:31:00      5  2014-01-02
2 2014-01-02 09:17:00      1  2014-01-02
3 2014-01-02 09:32:00      1  2014-01-02
4 2014-01-02 09:33:00      4  2014-01-02

In [26]:
count_by_cat = count_by_category.groupby('DateOnly').size().reset_index(name='Count') # I now have number of times an item was
# withdrawn from the library per day in 2014.  I need this for all three years

In [28]:
count_by_cat.tail(5)

       DateOnly  Count
351  2014-12-27    454
352  2014-12-28    275
353  2014-12-29    578
354  2014-12-30    557
355  2014-12-31    453